In [ ]:
================== EDA ==========================
1) Pandas : Data frame applications

2) Numpy  : Numerical python All math applications

3) Matplotlib: used for plotting

4) Seaborn   : used for plot

5) plotly    : use for plot

6) Bokhe     : plot

=================== Machine learning ==================
7) Sickit-learn: sklearn

===================== Deep Learning ==================
8) Tensorflow : Google

9) Keras      : Google

10) Pytorch   : FaceBook

====================== NLP ===========================
11) NLTK    : Natural langague tool kit 

12) Scipy

================ BERT =============================
13) Transformers : Hugging face (Google)

============ Google models =======================
14) Specific google packages

============== Azure ML=========================
15) Azure packages

============= GenAI ==============================
16) Gemini : Google

17) ChatGPT : OpenAI

====================== LangChain==================
18) LangChain packages

**create a dataframe using lisg**

In [ ]:
- list =====dictionary
- dictionary ====== list

** step-1**

**create a dataframe**

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame() # empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

In [ ]:
step-2 provide the data

In [2]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [3]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# what is the first positional argument:data
# second positional argument : index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [4]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  25      hyd
1  Avinash  30      blr
2    Akash  35  chennai

In [8]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

In [ ]:
step-3

In [ ]:
provide the columns names

In [10]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [14]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

In [13]:
df

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [15]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
step-4

**ADD new column**

In [ ]:
- If you want to add new column

- First you need to check the number of rows in already existed data

- For example in above the dataframe has 3 rows

- You need to create a new list with 3 rows

- that list equate to the dataframe

In [16]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [17]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [18]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [ ]:
step-5

**Update the already existed column**

In [ ]:
- create new column and update new column both are same way

In [19]:
df['Age']=[35,40,45]
df

     Names  Age     City JOB
0    Ayush   35      hyd  DS
1  Avinash   40      blr  DE
2    Akash   45  chennai  CS

In [ ]:
step-6

** change the index**

In [25]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [ ]:
Note

Number of list equals to Number of columns

Number of values inside list equals to Number of rows

When you create the data all the lists will be in same length

In [26]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

In [ ]:
step-7

In [ ]:
shape

Number of rows

Number of columns

In [27]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

In [ ]:
step-8

In [ ]:
**Drop the column**

- In order to drop column we required 3 arguments

- Column name

    - The coulmn name we need to mention

- axis

   -  axis=0 **represents rows**

   -  axis=1 **represnts columns**

- inplace

   - we are drop column means we are modifying the data frame

   - so this modifications we want to save in same variable or different variable

   - If you want to keep in the same varaible the **inplace=True**

In [28]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [38]:
df.drop('City',
        axis=1,
        inplace=True)

In [39]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [40]:
df1=df.drop('Age',axis=1) # do not give inplace=true

In [41]:
df # has two columns

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [42]:
 df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [ ]:
step-9

**Multiple columns drops**

In [43]:
# again read the data
import pandas as pd

names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [45]:
df.drop(['Age','City'],axis=1,inplace=True)

In [46]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [ ]:
step-10

In [ ]:
step-10

In [ ]:
Drop the rows

In [47]:
# again read the data
import pandas as pd

names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [51]:
df.drop('A',axis=0,inplace=True)

In [52]:
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

$Step-11$

**How to save the data frame**

- Generally data frames are two types

- csv (comma seperated value)

- excel

In [53]:
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [56]:
# file name= data
# extension=.csv
df.to_csv('data.csv')
df.to_csv('data2.csv', index=False)

In [55]:
# extension
# .xlsx
df.to_csv('data1.csv', index=False)

In [57]:
name=['Aayush','Avinash','Akash','Avani']
age=[20,25,30,35]
city=['Ahmedabad','Pune','Hydrabad','Mumbai']
country=['India','India','India','India']
data=zip(name,age,city,country)
cols=['Names','Age','City','Country']
idx=['A','B','C','D']
df_bhavesh=pd.DataFrame(data,index=idx,columns=cols)
df_bhavesh

     Names  Age       City Country
A   Aayush   20  Ahmedabad   India
B  Avinash   25       Pune   India
C    Akash   30   Hydrabad   India
D    Avani   35     Mumbai   India

In [ ]:
df_bhavesh.drop('A',axis=0,inplace=True)

In [58]:
df_bhavesh

     Names  Age       City Country
A   Aayush   20  Ahmedabad   India
B  Avinash   25       Pune   India
C    Akash   30   Hydrabad   India
D    Avani   35     Mumbai   India